Все мы знаем, что такое индексы, много раз создавали (метод деления отрезка пополам).
Но когда с индексами становится что то не так, мы не знаем куда податься?
Попытка понять "куда податься", какие есть подручные средства?
Что значит хороший индекс с тз. Postgres

Вступление
- о чем будет (вводная, обзорная, практическая
             , разберем реальные кейсы
             , поговорим о фантомных болях ораклистов
             , попробуем сформулировать best practice)
- какие инструменты (dbeaver 25x с плюшками)
- какие материалы использовались
- где что лежит (инструкции Confluence)
- для вопросов используем чат, ответим на них в конце (если не знаем, поищем, дополним Confluence)

Цель: оставить точку входа с материалами для практического применения


1) Собственно CREATE INDEX (Типы, Назначения)
2) Обзор по материалам докладов (расписаны тайм-коды)
3) Блоги, книга Postgre17-изнутри
4) Практическая часть (исследование индексов)
5) Боевые кейсы/"фантомные боли"/как поломать индексы/примеры из докладов

Подведение итогов:
- здравый смысл
- зоны внимания
- практические советы

